{
  "home": {
    "title": "Home",
    "subtitle": "Full Stack Software Developer",
    "description": "<p>I'm Lauren and I'm a Software Developer with a passion for creating modern websites and applications. I have professional experience creating web applications using C#/.NET, TypeScript/Next.js, and some Ruby on Rails and automations using JavaScript/Node.js and Azure Functions. My skills range from front end development to back end development with a slight personal preference working on the front end by creating and contributing to the UI/UX- but I still very much enjoy the thrill of solving complex logic on the back end.</p>"
  },
  "about": {
    "title": "About",
    "subtitle": "A bit about me",
    "description": "<p>Ever since I was little, I can remember being curious about how my belongings (toys, gadgets, etc.) worked. My mom told me I would take apart my toys as a child just to put them back together. Along with that curiosity came a drive and desire to accomplish any task I put my mind to. I was relentless and believed that if I put the time and effort into something, I could accomplish anything. I knew no limit.</p><p>Fast forward to now, an adult with more resources and an income! Those skills and traits manifested into hobbies and side projects- refurbishing old bikes, screen-printing, embroidery… just to name a few. I enjoy testing my knowledge and limits to see what I am able to accomplish with the tools I possess, and this is not limited to the Software Development world.</p><p>Prior to being a Software Developer, I spent a decade working in retail, specifically fashion merchandising. At first it was simply a way to pay the bills, but after some time, I realized that merchandising itself is a large puzzle to be solved and it became a passion of mine. It’s equivalent to a game of Tetris, balancing colors, shapes, sizes, and textures to meet a list of requirements all in one space to aesthetically entice customers. I got paid to solve puzzles and be creative all at the same time? Felt like a dream.</p><p>But as with how life goes, we all transform and grow. I had hit a wall and no longer saw an upward trajectory for my career and decided that my growth was more important than remaining comfortable. I quit my job, one of the only consistent safety nets I had ever known and enrolled in a coding bootcamp. I’ll keep it short and simply state that they are not for the faint of heart, but I made it to the other side and entered into the world of Tech.</p><p>So here I am now, a Software Developer. I have new passions to add to my list, like creating web applications that are both functional and creative. I transferred my skills from clothing to code. Now I enjoy flexing the skills I learned into back end and front end development, both of which pose their own challenges and allow for different solutions, logically and aesthetically. It’s an unlikely parallel that has allowed me to visualize my future again.</p>"
  },
  "projects": {
    "title": "Projects",
    "subtitle": "Projects I've worked on",
    "description": "Below are professional projects I have worked on in my career. To view personal projects, including the source code for this portfolio, please visit my <a href='https://github.com/laurenmilesdev' target='_blank' class='primary'>Github</a>.",
    "projects": [
      {
        "title": "BootcampOS",
        "company": "Tech Elevator",
        "technologies": ["Ruby on Rails", "Ruby", "PostgreSQL", "Redis", "RSpec"],
        "description": "Contributed to the BootcampOS application used by students enrolled in the Tech Elevator bootcamp. Our team paired with an external team (owned by Stride) that created the application to add features to the application that were specific to Tech Elevators needs. The application is used primarily by students and instructors to upload instruction content, student assignment submission and scoring, and instructor tracking of student scores and averages.",
        "companyUrl": "https://www.techelevator.com"
      },
      {
        "title": "Shipping Label Automation",
        "company": "Tech Elevator",
        "technologies": [
          "Node.js",
          "JavaScript",
          "Azure",
          "Jest",
          "Zoho API",
          "Postmark API",
          "Google Drive API",
          "Asset Panda API"
        ],
        "description": "Created an applications that contained two Azure Functions used for automating shipping label generation for the upcoming or ending Tech Elevator bootcamp cohorts. One function created shipping labels used to mail the students their laptops, and the other created the return shipping labels that were emailed to the students to return their laptops. Both functions also updated internal information used for departmental tracking. These functions ran on an HTTP trigger, triggering from a Zoho workflow.",
        "companyUrl": "https://www.techelevator.com"
      },
      {
        "title": "Roating Tokens Automation",
        "company": "Tech Elevator",
        "technologies": ["Node.js", "JavaScript", "Azure", "Jest", "Zoho API"],
        "description": "Created an application to house any Azure Functions created to rotate tokens needed for development or production environments. A specific function within the application would be used to fetch the necessary token and update the value in an Azure Key Vault. These functions ran on a timer trigger, updating the token with a new value before it expired.",
        "companyUrl": "https://www.techelevator.com"
      },
      {
        "title": "Women Wine & Web Design",
        "company": "Tech Elevator",
        "technologies": ["HTML", "CSS"],
        "description": "Instructed at Tech Elevator's Women Wine & Web Design event in Detroit, Michigan. The event invited local women to learn how to make a basic webpage using HTML and CSS. I lead the instruction of course material, teaching the participants the fundamentals of web development.",
        "companyUrl": "https://www.techelevator.com"
      },
      {
        "title": "Nationwide Children's Hospital Website",
        "company": "Nationwide Children's Hospital",
        "technologies": [".NET", "C#", "Sitecore"],
        "description": "Paired with the Marketing team to work on the NCH main website. Sitecore CRM was used to allow the Marketing team to make updates to the site while the Development team would create the framework and layout for the site's pages. This would include minor updates and enhancements. My time was mainly focused on enhancing accessibility within specific pages and forms to create a better experience for all users and meet audit requirements.",
        "companyUrl": "https://www.nationwidechildrens.org"
      },
      {
        "title": "KSBA Portal",
        "company": "KiZAN Technologies",
        "technologies": [".NET", "C#", "Telerik UI", "jQuery", "MSSQL"],
        "description": "Contributed to the re-write of a large portal for the Kentucky School Board Association. The web application included roles with user management for board members (add, edit, or delete users based on roles), a section to keep school board meeting minutes (create and edit an agenda, keep notes, track votes, and screen share the meeting live), a separate smaller application to record job applications for open positions, and other existing internal data on the legacy application. All the existing data was migrated over and enhancements were made to clean up the data and tables.",
        "companyUrl": "https://www.kizan.com"
      },
      {
        "title": "Four Roses Bourbon Internal Application",
        "company": "KiZAN Technologies",
        "technologies": [".NET", "C#", "Telerik UI", "jQuery", "MSSQL"],
        "description": "Contributed in creating an internal application for Four Roses to keep track of internal funding proposals. The web application allowed a user to compose a proposal and submit it to the proper internal department. Users on the receiving end would get an email when a proposal was submitted and have the capability of approving or rejecting the proposal or requesting more information. If more information was needed, the proposal would begin the process over again.",
        "companyUrl": "https://www.kizan.com"
      }
    ]
  },
  "resume": {
    "title": "Resume",
    "subtitle": "My resume",
    "description": "<p>Hard to view? On mobile? Click <a href='/files/Lauren_Miles_Resume.pdf' target='_blank' class='primary'>here</a> to open resume in a new tab.</p>"
  },
  "contacts": [
    {
      "name": "LinkedIn",
      "description": "Link to LinkedIn",
      "url": "https://www.linkedin.com/in/laurenmmiles",
      "imgSrc": "./img/desktop/linkedin-pixelated.png",
      "imgDescription": "LinkedIn logo"
    },
    {
      "name": "GitHub",
      "description": "Link to GitHub",
      "url": "https://github.com/laurenmilesdev",
      "imgSrc": "./img/desktop/github-pixelated.png",
      "imgDescription": "GitHub logo"
    },
    {
      "name": "Email",
      "description": "Email me",
      "url": "mailto: laurenmiles.dev@gmail.com",
      "imgSrc": "./img/desktop/github-pixelated.png",
      "imgDescription": "Email logo"
    }
  ],
  "menuItems": [
    {
      "title": "Lauren Miles Portfolio",
      "menuItemButtonId": "portfolio-menu-item-btn",
      "externalUrl": "",
      "window": {
        "title": "Lauren Miles Portfolio",
        "windowId": "portfolio-window",
        "startBarButtonId": "portfolio-start-bar-btn",
        "isInternetExplorerWindow": true,
        "addressBarUrl": "https://portfolio.laurenmilesdev.com/",
        "heightPercentage": 89,
        "widthPercentage": 90,
        "scroll": true
      }
    },
    {
      "title": "Help",
      "menuItemButtonId": "help-menu-item-btn",
      "externalUrl": "",
      "window": {
        "title": "Help",
        "windowId": "help-window",
        "startBarButtonId": "help-start-bar-btn",
        "isInternetExplorerWindow": false,
        "addressBarUrl": "",
        "heightPercentage": 60,
        "widthPercentage": 40,
        "scroll": false
      }
    }
  ],
  "openToWork": true
}
